<?php
// +----------------------------------------------------------------------
// | 枚举配置
// +----------------------------------------------------------------------
// | Author: Wuyh 2020-02-04
// +----------------------------------------------------------------------
return [
    //直播相关
    'live' => [
        'status' => [
            0 => '未开始',
            1 => '进行中',
            2 => '已结束',
        ],
    ],

    //商城订单
    'order_pay' => [
        //支付状态 1=未付款 3=部分付款 4=部分退款 5=已退款 99=已付款
        'status' => [
            0 => '待支付',
            1 => '部分退款',
            2 => '已退款',
            99 => '已支付'
        ],

        //支付方式
        'type' => [
            0 => '未知',
            1 => '微信支付',
            2 => '支付宝'
        ],
    ],

    //商城商品订单
    'goods_order' => [
        //发货状态
        'ship_status' => [
            0 => '未发货',
            1 => '部分发货',
            2 => '已发货',
            3 => '部分退货',
            4 => '已退货',
        ],

        //支付状态
        'pay_status' => [

        ]
    ],

    // 配置类型
    'config_type' => [
        'text' => '单行文本',
        'number' => '数字',
        'textarea' => '多行文本',
        'readonly' => '只读文本',
        'number' => '数字',
        'array' => '数组',
        'password' => '密码',
        'radio' => '单选框',
        'checkbox' => '复选框',
        'select' => '下拉框',
        'date' => '日期',
        'datetime' => '时间',
        'image' => '单张图片',
        'ueditor' => '富文本编辑器',
        'json' => 'JSON',
    ],

    //性别
    'sex' => [
        0 => '未知',
        1 => '女',
        2 => '男'
    ],

    //商品类型
    'goods_type' => [
        1 => '真实商品',
        2 => '虚拟商品'
    ],

    //订单对应状态
    'order_status_desc' => [
        'WAIT_PAY' => '待支付',
        'WAIT_SEND' => '待发货',
        'PORTION_SEND' => '部分发货',
        'WAIT_RECEIVE' => '待收货',
        'WAIT_CCOMMENT' => '待评价',
        'HAS_CCOMMENT' => '已评价',
        'CANCEL' => '已取消',
        'ALL_COMPLETED' => '已完成',
        'CANCELLED' => '已作废',
        'CANCEL_REFUND' => '已取消(已退款)',
        'AFTER_SALES' => '待售后',
    ],


     //流水号前缀
    'orders_prefix' => [
        'CWH' => 'CWH', //余额提现
        'RWH' => 'RWH', //红包提现
        'CA'  => 'CA', //钱包余额扣款
    ],

    //业务类型
    'business_type' => [
        //1 开头表示扣款
        '10001' => '余额提现', //余额提现 - 冻结
        '10002' => '红包提现', //红包提现 - 冻结
        '10003' => '余额提现审核通过', //余额提现审核通过 - 扣款
        '10004' => '红包提现审核通过', //红包提现审核通过 - 扣款

        //2 开头表示加款
        '20003' => '余额提现审核不通过', //余额提现审核不通过返还余额 - 加款
        '20004' => '红包提现审核不通过', //红包提现审核不通过返还红包 - 加款
    ],

    //金额类型
    'money_type' => [
        0 => '正常',
        1 => '冻结'
    ],

    //提现状态
    'withdraw_status' =>[
        0 => '待审核',
        1 => '待结算',
        2 => '在途',
        3 => '已结算',
        4 => '驳回',
    ],

    //商品类型
    'goods_type' => [
        1 => '真实商品',
        2 => '虚拟商品'
    ]


];